app/views/tasks/index.html.erb

  </tr>
  <% current_user.tasks.each do |task| %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ?  [["user_id", 1]]