app/views/group_tasks/_form.html.erb

SELECT "users"."email" FROM "users"
---
<%= form.label :'person in charge' %>
    <%= form.select :user_email, User.pluck(:email), required:true %>