app/controllers/group_tasks_controller.rb

def index
    @group_tasks = GroupTask.all
---
SELECT "group_tasks".* FROM "group_tasks"

def show
    @group_task = GroupTask.find(params[:id])
---
SELECT  "group_tasks".* FROM "group_tasks" WHERE "group_tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

def edit
   @group_task = GroupTask.find(params[:id])
---
SELECT  "group_tasks".* FROM "group_tasks" WHERE "group_tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

 def create
   @group_task = current_user.group_tasks.new(task_params)

  @group_task.save
---
SELECT  "group_tasks".* FROM "group_tasks" WHERE "group_tasks"."user_id" = ? AND "group_tasks"."id" = ? LIMIT ?  [["user_id", 1], ["id", 2], ["LIMIT", 1]]
INSERT INTO "group_tasks" ("title", "body", "status", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "hey"], ["body", "hellow group"], ["status", 1], ["user_id", 1], ["created_at", "2020-09-17 22:30:28.482547"], ["updated_at", "2020-09-17 22:30:28.482547"]]

def destroy
    @group_task  = current_user.group_task.find(params[:id])
    @group_task.destroy
---
SELECT  "group_tasks".* FROM "group_tasks" WHERE "group_tasks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "group_tasks" WHERE "group_tasks"."id" = ?  [["id", 2]]