app/controllers/tasks_controller.rb

def index
    @tasks = Task.paginate page: params[:page], per_page: 5
---
SELECT  "tasks".* FROM "tasks" LIMIT ?  [["LIMIT", 11]]
SELECT COUNT(*) FROM "tasks"

def show
    @task = current_user.tasks.find(params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ? AND "tasks"."id" = ? LIMIT ?  [["user_id", 1], ["id", 33], ["LIMIT", 1]]

def edit
  @task = current_user.tasks.find(params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ? AND "tasks"."id" = ? LIMIT ?  [["user_id", 1], ["id", 33], ["LIMIT", 1]]

 def create
  @task = current_user.tasks.new(task_params)

  if @task.save
---
INSERT INTO "tasks" ("name", "status", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["name", "etete"], ["status", 1], ["created_at", "2020-09-17 20:59:20.478309"], ["updated_at", "2020-09-17 20:59:20.478309"], ["user_id", 3]]

 def update
 @task = current_user.tasks.find(params[:id])

   if @task.update(task_params)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ? AND "tasks"."id" = ? LIMIT ?  [["user_id", 1], ["id", 33], ["LIMIT", 1]]
UPDATE "tasks" SET "status" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["status", 1], ["updated_at", "2020-09-17 20:46:30.187642"], ["id", 33]]